[{
  "_id": {
    "$oid": "67fdc19c27ce288729c5d974"
  },
  "title": "Here One Moment",
  "authors": [
    "Liane Moriarty"
  ],
  "description": "From the author of bestselling phenomenon Big Little Lies comes a compelling novel of family and fate, as a mysterious old woman sows confusion and paranoia in the lives of a disparate group of individuals.",
  "price": 37.99,
  "publisher": "Pan Macmillan",
  "publishDate": {
    "$date": "2024-12-09T00:00:00.000Z"
  },
  "isbn": "9781760785031",
  "format": "Trade Paperback",
  "pages": 528,
  "weight": "358g",
  "dimensions": "233 x 154 x 40 mm",
  "synopsis": "On a plane bound for Sydney the unassuming woman from seat 4D walks down the aisle making unsettling predictions about the passengers. And six strangers find their lives unexpectedly crossing. Each tries to put the experience behind them. But, just weeks later, they can't any longer. Because not believing a prediction is easy, Until it comes true . . .",
  "coverImage": "here-one-moment.jpg",
  "createdAt": {
    "$date": "2025-04-15T02:17:00.636Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "67fdc19c27ce288729c5d975"
  },
  "title": "In Too Deep: (Jack Reacher 29)",
  "authors": [
    "Lee Child",
    "Andrew Child"
  ],
  "description": "Reacher finds himself the captive of a gang who have some very disturbing plans in this rollercoaster ride of a thriller...",
  "price": 38,
  "publisher": "Transworld Publishers Ltd",
  "publishDate": {
    "$date": "2024-10-22T00:00:00.000Z"
  },
  "isbn": "9780857505606",
  "format": "Trade Paperback",
  "pages": 384,
  "weight": "418g",
  "dimensions": "234 x 153 x 40 mm",
  "synopsis": "Reacher had no idea where he was. No idea how he had got there. But someone must have brought him...",
  "coverImage": "in-too-deep.jpg",
  "createdAt": {
    "$date": "2025-04-15T02:17:00.636Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "67fdc19c27ce288729c5d976"
  },
  "title": "Sunrise on the Reaping",
  "authors": [
    "Suzanne Collins"
  ],
  "description": "The eagerly awaited fifth Hunger Games book - and second prequel - places fan-favourite Haymitch Abernathy centre stage in an unputdownable tale of danger, action and intrigue set during the fiftieth deadly contest",
  "price": 19.99,
  "publisher": "Scholastic",
  "publishDate": {
    "$date": "2025-03-19T00:00:00.000Z"
  },
  "isbn": "9781761641176",
  "format": "Paperback",
  "pages": 416,
  "weight": "660g",
  "dimensions": "240 x 160 x 37 mm",
  "synopsis": "When you've been set up to lose everything you love, what is there left to fight for?...",
  "coverImage": "sunrise-reaping.jpg",
  "createdAt": {
    "$date": "2025-04-15T02:17:00.636Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "67fdc19c27ce288729c5d977"
  },
  "title": "Nobody's Fool",
  "authors": [
    "Harlan Coben"
  ],
  "description": "From the mega-selling author of Tell No One and Think Twice comes the electrifying sequel to Fool Me Once...",
  "price": 29.99,
  "publisher": "Cornerstone",
  "publishDate": {
    "$date": "2025-03-25T00:00:00.000Z"
  },
  "isbn": "9781529906134",
  "format": "Paperback",
  "pages": 352,
  "weight": "750g",
  "dimensions": "234 x 153 x 40 mm",
  "synopsis": "A year after the devastating events that took place in Fool Me Once, a secret from former Detective Sami Kierce's college days comes back to haunt him...",
  "coverImage": "nobodys-fool.jpg",
  "createdAt": {
    "$date": "2025-04-15T02:17:00.637Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "67fdc19c27ce288729c5d978"
  },
  "title": "25 Alive",
  "authors": [
    "James Patterson",
    "Maxine Paetro"
  ],
  "description": "The Women's Murder Club return in the 25th riveting instalment in Patterson's bestselling series...",
  "price": 39.99,
  "publisher": "Cornerstone",
  "publishDate": {
    "$date": "2025-02-25T00:00:00.000Z"
  },
  "isbn": "9781529923001",
  "format": "Trade Paperback",
  "pages": 400,
  "weight": "573g",
  "dimensions": "234 x 153 x 40 mm",
  "synopsis": "Sergeant Lindsay Boxer's friend and former partner is brutally murdered in San Francisco's Golden Gate Park...",
  "coverImage": "25-alive.jpg",
  "createdAt": {
    "$date": "2025-04-15T02:17:00.637Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "67fdc19c27ce288729c5d979"
  },
  "title": "Madly, Deeply: The Alan Rickman Diaries",
  "authors": [
    "Alan Rickman"
  ],
  "description": "The beloved and much-missed actor offers his legion of fans a window into Hollywood glamour...",
  "price": 75,
  "publisher": "Canongate Books",
  "publishDate": {
    "$date": "2022-11-17T00:00:00.000Z"
  },
  "isbn": "9781838854799",
  "format": "Hardback",
  "pages": 496,
  "weight": "758g",
  "dimensions": "240 x 162 x 43 mm",
  "synopsis": "Alan Rickman remains one of the most beloved actors of all time across almost every genre...",
  "coverImage": "alan-rickman-diaries.jpg",
  "createdAt": {
    "$date": "2025-04-15T02:17:00.637Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "67fdc19c27ce288729c5d97a"
  },
  "title": "38 Londres Street",
  "authors": [
    "Philippe Sands"
  ],
  "description": "Through this captivating blend of memoir, travelogue, detective story, and courtroom drama, the award-winning author of East West Street and The Last Colony chronicles the entwining stories of Chilean dictator Augusto Pinochet and senior SS officer Walther Rauff in a powerful examination of historical atrocities and the search for justice.",
  "price": 73,
  "publisher": "Orion Publishing Co",
  "publishDate": {
    "$date": "2025-03-04T00:00:00.000Z"
  },
  "isbn": "9781474620741",
  "format": "Hardback",
  "pages": 780,
  "weight": "700g",
  "dimensions": "242 x 162 x 40 mm",
  "synopsis": "In the heart of Santiago, the infamous 38 Londres Street becomes the haunting backdrop for a riveting tale that intertwines the arrest of Augusto Pinochet in London, the post-war life of senior SS officer Walther Rauff in Chilean Patagonia and the sinister connections between the two men. Rauff, responsible for the wartime horrors of mobile gas vans, flees justice after the war and finds an unlikely refuge in Chile...",
  "coverImage": "londres.jpg",
  "createdAt": {
    "$date": "2025-04-15T02:17:00.637Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "67fdc19c27ce288729c5d97b"
  },
  "title": "The Let Them",
  "authors": [
    "Mel Robbins"
  ],
  "description": "The bestselling motivational coach behind The High 5 Habit delivers an empowering philosophy for breaking free of other people's negative energy and living your best life.",
  "price": 32,
  "publisher": "Hay House Inc",
  "publishDate": {
    "$date": "2025-01-07T00:00:00.000Z"
  },
  "isbn": "9781401994136",
  "format": "Hardback",
  "pages": 336,
  "weight": "540g",
  "dimensions": "233 x 153 x 23 mm",
  "synopsis": "The Let Them Theory puts the power to create a life you love back in your hands, and this book will show you exactly how to do it.",
  "coverImage": "let-them.jpg",
  "createdAt": {
    "$date": "2025-04-15T02:17:00.637Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "67fdc19c27ce288729c5d97c"
  },
  "title": "Shakespeare",
  "authors": [
    "Judi Dench"
  ],
  "description": "Recounted with Dame Judi Dench's characteristic twinkling wit, this endlessly fascinating volume finds the legendary actress reflecting on every Shakespearean performance in her stellar career.",
  "price": 35,
  "publisher": "Penguin Books Ltd",
  "publishDate": {
    "$date": "2024-09-26T00:00:00.000Z"
  },
  "isbn": "9781405956420",
  "format": "Trade Paperback",
  "pages": 400,
  "weight": "278g",
  "dimensions": "196 x 128 x 25 mm",
  "synopsis": "Taking a curtain call with a live snake in her wig... Acting opposite a child with a pumpkin on his head... Judi Dench shares her experiences and reflections on every Shakespearean role she has played throughout her seven-decade career.",
  "coverImage": "shakespeare.jpg",
  "createdAt": {
    "$date": "2025-04-15T02:17:00.638Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "67fdc19c27ce288729c5d97d"
  },
  "title": "The Last Secret Agent",
  "authors": [
    "Pippa Latour",
    "Jude Dobson"
  ],
  "description": "In this vivid and eye-opening tale of wartime service and danger, the last surviving SOE agent recounts her time working behind enemy lines in Nazi-occupied France for the first time.",
  "price": 37.99,
  "publisher": "Allen & Unwin Aotearoa New Zealand",
  "publishDate": {
    "$date": "2024-06-23T00:00:00.000Z"
  },
  "isbn": "9781991006561",
  "format": "Trade Paperback",
  "pages": 288,
  "weight": "480g",
  "dimensions": "238 x 160 x 32 mm",
  "synopsis": "'You know you can change your mind, don't you? Even now. Even when you are halfway across the English Channel. Any time before you jump.' Yes, she did. An hour later, she was parachuting into Nazi-occupied France to begin a mission that was fraught with danger...",
  "coverImage": "last-secret-agent.jpg",
  "createdAt": {
    "$date": "2025-04-15T02:17:00.638Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "67fde30f5b8d8fbf9862e8eb"
  },
  "title": "Fearless",
  "authors": [
    "Lauren Roberts"
  ],
  "description": "Paedyn and Kai embark upon their final adventure in the thrilling conclusion to Roberts' megaselling YA romantasy series.",
  "price": 28.99,
  "publisher": "Simon & Schuster Ltd",
  "publishDate": {
    "$date": "2025-04-08T00:00:00.000Z"
  },
  "isbn": "9781398543454",
  "format": "Paperback",
  "pages": 528,
  "dimensions": "234 x 153 x 35 mm",
  "synopsis": "Paedyn Gray and Kai Azer return to the Kingdom of Ilya... \n\nAnd Paedyn has a life-altering choice to make. Whatever she decides will determine her fate – and the fate of those around her – forever. \n\nIn the ultimate battle of love and loyalty, who wins? \n\nBe swept away by the conclusion to the smash hit, dagger-to-the-throat romantasy trilogy. ",
  "coverImage": "http://localhost:5000/uploads/fearless.jpg",
  "createdAt": {
    "$date": "2025-04-15T04:39:43.412Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "67fde59711d94f19879f9cfa"
  },
  "title": "Ali Mau",
  "authors": [
    "No Words For This"
  ],
  "description": "Description\nThe much anticipated memoir by media personality Alison Mau In my family, we never talked about the past... Since the age of twelve, Alison Mau wanted to be a journalist just like her dad. A beer-swilling, straight-talking man who was rough around the edges but could quote passages of Hamlet at will, he taught Ali everything from rabbit-hunting to throwing a punch and crafting a sharp sentence. Didn't matter that he complained loudly of his sexless marriage and put down the ...",
  "price": 39.99,
  "publisher": "HarperCollins Publishers (New Zealand)",
  "publishDate": {
    "$date": "2025-04-01T00:00:00.000Z"
  },
  "isbn": "9781775542537",
  "format": "Trade Paperback",
  "pages": 304,
  "weight": "",
  "dimensions": "H235 x W155 x S25",
  "synopsis": "The much anticipated memoir by media personality Alison Mau In my family, we never talked about the past... Since the age of twelve, Alison Mau wanted to be a journalist just like her dad. A beer-swilling, straight-talking man who was rough around the edges but could quote passages of Hamlet at will, he taught Ali everything from rabbit-hunting to throwing a punch and crafting a sharp sentence. Didn't matter that he complained loudly of his sexless marriage and put down the women in their social circle - these were just a mark of the times, Ali thought. Ali grew up in suburban Melbourne in the 1970s, and got her start in journalism at The Warracknabeal Herald, where the entire reporting staff of the eight-page gazette was female. But from there, Ali would go on to work in some of the most infamous and patriarchal Australian newsrooms of the 80s and 90s, including the Herald Sun, and Australia's top TV news station, Channel 9, under the notorious John Sorrel. When romance took her to New Zealand, Ali made a glittering career for herself as New Zealand's media darling of the early noughties, one half of the country's most recognizable news power-couple and going on to host shows such as Breakfast, Seven Sharp, Fair Go and RadioLIVE. Then one day Ali's sister called her out of the blue for a conversation forty years in the making. In this book, Ali recounts what happened when she reckoned with flashbacks of a buried past. She began to question her whole identity, and the reason she became a journalist. It set Ali on a new path for herself and for other survivors of sexual abuse. As the leading journalist for New Zealand's #MeToo movement, Ali was forced to ask the same questions so many others face: Am I strong enough to go through this? What does justice look like? This is an inspiring, personal and honest memoir about family, love, purpose, and rising from the ashes to re-discover yourself. ",
  "coverImage": "http://localhost:5000/uploads/ali-mau.jpg",
  "createdAt": {
    "$date": "2025-04-15T04:50:31.173Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "67fdee00f06f1c0e9060ae3f"
  },
  "title": "Frankie",
  "authors": [
    "Graham Norton"
  ],
  "description": "This expansive, heartfelt story of memory and human connection from the bestselling author of Home Stretch and A Keeper finds an elderly Londoner and her young Irish carer bond, as the titular protagonist tells him the story of her past filled with larger-than-life characters.",
  "price": 37.99,
  "publisher": "Hodder & Stoughton",
  "publishDate": {
    "$date": "2024-09-10T00:00:00.000Z"
  },
  "isbn": "9781529391459",
  "format": "Paperback",
  "pages": 336,
  "weight": "305g",
  "dimensions": "234 x 153 x 35 mm",
  "synopsis": "\n\nFrankie Howe has lived a long life and her small London flat is crammed full of art, furniture and memories. Damian, her young carer, listens as she gradually tells him parts of her story - a story that takes us into a progressive, daring world of New York artists on the brink of fame, aspiring writers and larger-than-life characters.\n\nAlways just on the periphery, looking on, young Frankie is never quite sure enough of herself to take centre stage. But the outsider holds certain advantages, sees things others don't, can influence without drawing attention. And when the map has been lost, it's anyone's guess where you may end up, or the accidental choices you find you have made. Frankie discovers that life is not always the one we hope for, or the one others expect of us.\n\nTaking us from Ireland in the 1940s, to the dazzling art scene of 1960s New York by way of London, Frankie is an immersive, decade-sweeping story that brims with Graham Norton's trademark heart, intelligence and compellingly written characters.\n",
  "coverImage": "/uploads/frankie.jpg",
  "createdAt": {
    "$date": "2025-04-15T05:26:24.300Z"
  },
  "__v": 0
}]